2019/java-io-abstract.html
<!DOCTYPE html>
<html lang="zh-CN">
<head>
<!-- 2019-10-31 四 11:27 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Java 中的 I/O 抽象</title>
<meta name="generator" content="Org mode">
<meta name="author" content="rgb-24bit">
<link rel="stylesheet" type="text/css" href="https://rgb-24bit.github.io/blog/misc/style.css">
<!-- Global site tag (gtag.js) - Google Analytics -->
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="https://rgb-24bit.github.io/blog/"> UP </a>
 |
 <a accesskey="H" href="https://rgb-24bit.github.io"> HOME </a>
</div><div id="content">
<h1 class="title">Java 中的 I/O 抽象</h1>
<div id="table-of-contents">
<h2>&#30446;&#24405;</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orge77a4c5">1. 前言</a></li>
<li><a href="#org4371537">2. 字节流</a>
<ul>
<li><a href="#orgfecfa15">2.1. 常用实现</a></li>
</ul>
</li>
<li><a href="#org86683cc">3. 字符流</a>
<ul>
<li><a href="#org6e514f2">3.1. 常用实现</a></li>
</ul>
</li>
<li><a href="#org5edb499">4. 缓冲区</a></li>
<li><a href="#org99314bf">5. 各种字节流</a></li>
<li><a href="#orgf635ebc">6. 结语</a></li>
</ul>
</div>
</div>

<div id="outline-container-orge77a4c5" class="outline-2">
<h2 id="orge77a4c5"><span class="section-number-2">1</span> 前言</h2>
<div class="outline-text-2" id="text-1">
<p>
由于在接触 Java 之前使用的语言是 Python，所以在转到 Java 后对 Java 的 I/O 操作各种不习惯。
</p>

<p>
研究后发现 Java 的 I/O 模型和 Python 的基本上还是一样的，只是在接口的设计上有些区别，主要是为了符合 OOP 的思想吧。
</p>

<p>
这篇博客的主要内容便是和 Java I/O 相关的总结。
</p>
</div>
</div>

<div id="outline-container-org4371537" class="outline-2">
<h2 id="org4371537"><span class="section-number-2">2</span> 字节流</h2>
<div class="outline-text-2" id="text-2">
<p>
和 Python 一样，Java 中最底层的 I/O 接口处理的是 <b>字节序列</b>, 但是和 Python 中的文件对象一把梭不一样，Java 将输入和输出分别抽象为了两个对象。
</p>

<p>
处理输入流的 <code>InputStream</code> 和处理输出流的 <code>OutputStream</code>.
</p>

<p>
这两个类都是抽象类，因此具体的和输入输出相关的功能将由它们的子类实现，而它们则提供一些基本的接口：
</p>
<ul class="org-ul">
<li><p>
InputStream 提供的部分接口：
</p>
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">方法</th>
<th scope="col" class="org-left">作用</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">abstract int read()</td>
<td class="org-left">读取一个字节，碰到输入流结尾时返回 -1</td>
</tr>

<tr>
<td class="org-left">int read(byte[] b)</td>
<td class="org-left">将数据读入提供的字节数组，并返回实际读入的字节数，或者在碰到输入流结尾时返回 -1</td>
</tr>

<tr>
<td class="org-left">int read(byte[] b, int off, int len)</td>
<td class="org-left">将数据读入提供的字节数组，并返回实际读入的字节数，或者在碰到输入流结尾时返回 -1，写入的范围由 off 和 len 指定</td>
</tr>
</tbody>
</table></li>

<li><p>
OutputStream 提供的部分接口：
</p>
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">方法</th>
<th scope="col" class="org-left">作用</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">abstract void write()</td>
<td class="org-left">写入一个字节的数据</td>
</tr>

<tr>
<td class="org-left">void write(byte[] b)</td>
<td class="org-left">写入一个字节数组的数据</td>
</tr>

<tr>
<td class="org-left">void write(byte[] b, int off, int len)</td>
<td class="org-left">写入字节数组的数据，数据范围由 off 和 len 指定</td>
</tr>

<tr>
<td class="org-left">void flush()</td>
<td class="org-left">将缓存的数据全部写入目标</td>
</tr>
</tbody>
</table></li>
</ul>

<p>
可以看到，抽象方法其实只有 <code>read()</code> 和 <code>write()</code>, 其他的方法会调用这两个方法，因此子类只需要提供这两个抽象方法的实现就可以了。
</p>
</div>

<div id="outline-container-orgfecfa15" class="outline-3">
<h3 id="orgfecfa15"><span class="section-number-3">2.1</span> 常用实现</h3>
<div class="outline-text-3" id="text-2-1">
<p>
Java 中字节流的具体实现很多，但最常用的应该就是和 <b>文件</b> 相关的了，因此在这里将它们列举出来：
</p>
<ul class="org-ul">
<li><p>
FileInputStream 的构造方法：
</p>
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">构造方法</th>
<th scope="col" class="org-left">说明</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">FileInputStream(FileDescriptor fdObj)</td>
<td class="org-left">根据指定的文件描述符创建输入流</td>
</tr>

<tr>
<td class="org-left">FileInputStream(File file)</td>
<td class="org-left">根据指定的文件对象创建输入流</td>
</tr>

<tr>
<td class="org-left">FileInputStream(String name)</td>
<td class="org-left">根据指定的文件名称创建输入流</td>
</tr>
</tbody>
</table></li>

<li><p>
FileOutputStream 的构造方法和 FileInputStream 的基本相同，不同的是多了两个存在布尔标志的构造方法：
</p>
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">构造方法</th>
<th scope="col" class="org-left">说明</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">FileOutputStream(File file, boolean append)</td>
<td class="org-left">根据指定的文件对象创建输出流，布尔标志指定是否追加</td>
</tr>

<tr>
<td class="org-left">FileOutputStream(String name, boolean append)</td>
<td class="org-left">根据指定的文件名称创建输出流，布尔标志指定是否追加</td>
</tr>
</tbody>
</table></li>
</ul>

<p>
在之前学习 C 和 Python 的过程中便了解到 <b>文件描述符</b> 是一个很有用的东西，通过它可以实现一些很有用的功能。
</p>

<p>
在 Java 中获取文件描述符可以通过调用 <code>FileInputStream</code> 和 <code>FileOutputStream</code> 对象的 <code>getFD()</code> 方法完成，而标准输入输出的文件描述符则需要通过 <code>FileDescriptor</code> 的静态字段获取。
</p>
</div>
</div>
</div>

<div id="outline-container-org86683cc" class="outline-2">
<h2 id="org86683cc"><span class="section-number-2">3</span> 字符流</h2>
<div class="outline-text-2" id="text-3">
<p>
通过字节流可以完成很多 I/O 操作，但是如果连文本文件的处理都通过字节流来完成的话就太麻烦了。因此，为了解决这样的问题，字符流便诞生了。
</p>

<p>
<b>字符流</b> 是对 <b>字节流</b> 的一层封装，在 Java 中通过 <code>Reader</code> 和 <code>Writer</code> 这两个抽象类来表示。
</p>

<p>
和 InputStream 和 OutputStream 一样，具体的功能将由它们的子类实现，而它们则提供一些基本的接口，这里列举出最基本的接口：
</p>
<ul class="org-ul">
<li><p>
Reader：
</p>
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">方法</th>
<th scope="col" class="org-left">作用</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">int read()</td>
<td class="org-left">读取单个字符，返回值是该字符的码点，到达流的末尾就返回 -1</td>
</tr>
</tbody>
</table></li>

<li><p>
Writer：
</p>
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">方法</th>
<th scope="col" class="org-left">作用</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">void write(int c)</td>
<td class="org-left">写入单个字符</td>
</tr>

<tr>
<td class="org-left">void write(String str)</td>
<td class="org-left">写入字符串</td>
</tr>

<tr>
<td class="org-left">abstract void flush()</td>
<td class="org-left">将缓存的数据全部写入目标</td>
</tr>
</tbody>
</table></li>
</ul>

<p>
需要注意的是，这里的 <code>read()</code> 方法和 <code>write()</code> 都不是抽象方法了，因为这两个方法实际上都是调用内部的 <b>字节流</b> 完成工作，因此，只需要相应的字节流实现基本的功能就足够了。
</p>
</div>

<div id="outline-container-org6e514f2" class="outline-3">
<h3 id="org6e514f2"><span class="section-number-3">3.1</span> 常用实现</h3>
<div class="outline-text-3" id="text-3-1">
<p>
Java 字符流实现中最常用的应该是 <code>InputStreamReader</code> 和 <code>OutputStreamWriter</code> 了，它们的构造方法如下：
</p>
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Reader 构造方法</th>
<th scope="col" class="org-left">Writer 构造方法</th>
<th scope="col" class="org-left">说明</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">InputStreamReader(InputStream in)</td>
<td class="org-left">OutputStreamWriter(OutputStream out)</td>
<td class="org-left">根据默认编码创建字符流</td>
</tr>

<tr>
<td class="org-left">InputStreamReader(InputStream in, Charset cs)</td>
<td class="org-left">OutputStreamWriter(OutputStream out, Charset cs)</td>
<td class="org-left">根据指定字符集创建字符流</td>
</tr>

<tr>
<td class="org-left">InputStreamReader(InputStream in, CharsetDecoder dec)</td>
<td class="org-left">OutputStreamWriter(OutputStream out, CharsetEncoder dec)</td>
<td class="org-left">根据指定字符集解/编码器创建字符流</td>
</tr>

<tr>
<td class="org-left">InputStreamReader(InputStream in, String charsetName)</td>
<td class="org-left">OutputStreamWriter(OutputStream out, String charsetName)</td>
<td class="org-left">根据指定字符集名称创建字符流</td>
</tr>
</tbody>
</table>

<p>
同时，针对文件操作，Java 提供了这两个类的子类 <code>FileReader</code> 和 <code>FileWriter</code>, 使用这两个类可以省略手动创建字节流的过程，具体内容可以查看相关文档。
</p>
</div>
</div>
</div>

<div id="outline-container-org5edb499" class="outline-2">
<h2 id="org5edb499"><span class="section-number-2">4</span> 缓冲区</h2>
<div class="outline-text-2" id="text-4">
<p>
I/O 操作的一个常识：频繁的 I/O 操作的效率是很低的，所以我们加一个缓冲区吧！
</p>

<p>
Java 中我们可以通过 <code>BufferedInputStream</code> 和 <code>BufferedOutputStream</code> 为字节流添加缓冲区，通过 <code>BufferedReader</code> 和 <code>BufferedWriter</code> 为字符流添加缓冲区。
</p>

<p>
这样一来，一段经典的代码就成型了：
</p>
<div class="org-src-container">
<pre class="src src-java"><span class="org-comment-delimiter">// </span><span class="org-comment">&#23383;&#33410;&#27969; -&gt; &#23383;&#31526;&#27969; -&gt; &#32531;&#20914;&#21306;</span>
<span class="org-type">BufferedReader</span> <span class="org-variable-name">br</span> = <span class="org-keyword">new</span> <span class="org-type">BufferedReader</span>(<span class="org-keyword">new</span> <span class="org-type">InputStreamReader</span>(<span class="org-keyword">new</span> <span class="org-type">FileInputStream</span>(<span class="org-string">"example.txt"</span>)));
</pre>
</div>

<p>
很完美是不是！
</p>
</div>
</div>

<div id="outline-container-org99314bf" class="outline-2">
<h2 id="org99314bf"><span class="section-number-2">5</span> 各种字节流</h2>
<div class="outline-text-2" id="text-5">
<p>
虽然说最常用的字节流式文件字节流（大概），但是，输入输出的环境是复杂的，处理文件以外，其他的设备如内存、网络等都可能用到输入输出，而且不同的条件下需要的功能还不一样。
</p>

<p>
字符流的需求相对来说较为统一，因此一般情况下 <code>InputStreamReader</code> 和 <code>OutputStreamWriter</code> 完全可以一统天下，但是对于 <b>字节流</b> 来说，Java 提供了各种各样的实现。
</p>

<p>
尤其是 <code>FilterInputStream</code> 和 <code>FilterOutputStream</code> 的子类，它们都有以输出/输出流作为参数的构造方法，因此，我们可以将不同的 <code>Filter</code> 组装起来，得到我们想要的功能。
</p>

<p>
这是除了 <b>字节-字符-缓冲</b> 以外让我觉得最 Beautiful 的设计，能够灵活的适应各种需求。
</p>

<p>
这些 <code>Filter</code> 的使用可以查看官方文档或者看看《Java 核心技术卷卷二》的 <b>2.1.3</b> 节，这是相当棒的功能。
</p>
</div>
</div>

<div id="outline-container-orgf635ebc" class="outline-2">
<h2 id="orgf635ebc"><span class="section-number-2">6</span> 结语</h2>
<div class="outline-text-2" id="text-6">
<p>
写完博客回头看，感觉质量有点差……
</p>

<p>
篇幅太少了，很多东西都没有说清楚，属于适合自己回顾的博客 @_@
</p>

<p>
另外，很想吐槽的是：作为面向对象的语言，Java 内置的网络库居然没有将 <b>请求</b> 和 <b>响应</b> 这两个对象分开！！！
</p>

<p>
用起来各种不顺手……
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
版权声明：本作品采用<a rel="license" href="http://creativecommons.org/licenses/by-nc/4.0/">知识共享署名-非商业性使用 4.0 国际许可协议</a>进行许可
<div id="disqus_thread"></div>
<script type="text/javascript">
  var disqus_shortname = 'rgb-24bit';
  (function() {
    var dsq = document.createElement('script'); dsq.type = 'text/javascript'; dsq.async = true;
    dsq.src = '//' + disqus_shortname + '.disqus.com/embed.js';
    (document.getElementsByTagName('head')[0] || document.getElementsByTagName('body')[0]).appendChild(dsq);
  })();
</script>
</div>
</body>
</html>
